6M/0deg_2KC/constant/turbulenceThermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationThermalType RASThermal;

RASThermal
{
    RASThermalModel        KaysCorrelation;

    turbulenceThermal      on;

    printCoeffs     on;
    
    KaysCorrelationCoeffs
        {
        Prt0    0.9;
        A       0.7;
        PrtMax  100;
        }
}

// ************************************************************************* //
